{
    "project_name": "My Project",
    "description": "A short description of the project.",
    "repo_name": "{{ cookiecutter.project_name.lower().replace(' ', '-').replace('_', '-') }}",
    "src_package_name": "{{ cookiecutter.repo_name.replace('-', '_') }}",
    "src_package_name_short": "{{ cookiecutter.src_package_name }}",
    "platform": ["onprem", "gcp"],
    "orchestrator": ["runai", "polyaxon", "none"],
    "proj_name": "sample-project",
    "registry_project_path": "registry.domain.tld/sample-project/my-project",
	"default_problem_template": ["cv", "nlp", "tabular", "none"],
    "author_name": "AISG",
    "__prompts__": {
        "project_name": "project_name - Name of project that will be the header for the README.md. Input to start with alphabet. Only whitespace as separators.",
        "description": "description - A short description of the project that will be populated in README.md. Max of 72 characters.",
        "repo_name": "repo_name - Name of repository. Name of the repository folder. Input to start with alphabet characters. No whitespaces or underscores are allowed.",
        "src_package_name": "src_package_name - Name of the source code's package under the src folder. Input to start with alphabet characters. No whitespaces or hyphens are allowed.",
        "src_package_name_short": "src_package_name_short - The alias for the source code's package. Input to start with alphabet characters. No whitespaces or hyphens are allowed.",
        "platform": {
            "__prompt__": "platform - The platform the project is running on.",
            "onprem": "onprem - On premise",
            "gcp": "gcp - Google Cloud Platform (not implemented yet)"
        },
        "orchestrator": {
            "__prompt__": "orchestrator - The orchestrator the project is using.",
            "runai": "runai - Run:AI",
            "polyaxon": "polyaxon - Polyaxon (for legacy purposes, not implemented yet)",
            "noorch": "noorch - No orchestrator (not implemented yet)"
        },
        "proj_name": "proj_name - The project name used in by the repository. If you're using Run:AI, this will be the Run:AI project name used by the repository.",
        "registry_project_path": "registry_project_path - Path of the registry repository for your container images to be located under. Cannot end with a slash character.",
        "author_name": "author_name - Your alias or project team's name. Relatively arbitrary. No hyphens are allowed.",
		"default_problem_template": "default_problem_template - Initialise the repository with a default problem statement, only accepts 'cv', 'nlp', 'tabular', no source codes will be populated for any other values."
    }
}
